IdeaRS.OpenModel.Concrete.SupportType
Types of support

IdeaRS.OpenModel.Concrete.SupportType.NoSupport
Without support

IdeaRS.OpenModel.Concrete.SupportType.Hinge
Hinge type

IdeaRS.OpenModel.Concrete.SupportType.Rigid
Rigid type

IdeaRS.OpenModel.Concrete.SupportType.HingeNoSupport
Combination of hinge and nosupport

IdeaRS.OpenModel.Concrete.SupportType.HingeHinge
Combination of hinge and hinge

IdeaRS.OpenModel.Concrete.SupportType.RigidNoSupport
Combination of rigid and nosupport

IdeaRS.OpenModel.Concrete.SupportType.RigidHinge
Combination of rigid and hinge

IdeaRS.OpenModel.Concrete.SupportType.RigidRigid
Combination of rigid and rigid